[GraphicalObject]
Name=rid
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgrid|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=lamp      ,  IMAGESET   ,hpgbut02.dll
6=recyclevlv,  IMAGESET   ,hpgbut02.dll
7=purgevlv  ,  IMAGESET   ,hpgbut02.dll
8=receiver  ,  IMAGESET   ,hpgbut02.dll
9=plot      ,  PUSHBUTTON ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel rid
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "RIDlogbook"|示差屈折率検出器ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "RIDlogbook"|示差屈折率検出器ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "RIDtemp"|示差屈折率検出器温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "RIDtemp"|示差屈折率検出器温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "RIDmethod"|示差屈折率検出器メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "RIDmethod"|示差屈折率検出器メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET lamp]
x=170
y=105
width=28
height=33
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgrilmp1|BMP.dgrilmp1|BMP.dgrilmp1|@view.floatingmenu "DiagGuiReg[4]", "RIDlamp"|示差屈折率検出器 - ランプ
set1= BMP.dgrilmp2|BMP.dgrilmp2|BMP.dgrilmp2|@view.floatingmenu "DiagGuiReg[4]", "RIDlamp"|示差屈折率検出器 - ランプ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET recyclevlv]
x=106
y=43
width=38
height=26
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgrecyc1|BMP.dgrecyc1|BMP.dgrecyc1|@view.floatingmenu "DiagGuiReg[4]", "RIDrecyclevlv"|示差屈折率検出器 - リサイクル バルブ
set1= BMP.dgrecyc2|BMP.dgrecyc2|BMP.dgrecyc2|@view.floatingmenu "DiagGuiReg[4]", "RIDrecyclevlv"|示差屈折率検出器 - リサイクル バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET purgevlv]
x=141
y=2
width=26
height=37
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgpurge1|BMP.dgpurge1|BMP.dgpurge1|@view.floatingmenu "DiagGuiReg[4]", "RIDPurgeVlv"|示差屈折率検出器 - パージ バルブ
set1= BMP.dgpurge2|BMP.dgpurge2|BMP.dgpurge2|@view.floatingmenu "DiagGuiReg[4]", "RIDPurgeVlv"|示差屈折率検出器 - パージ バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET receiver]
x=243
y=53
width=33
height=32
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgrecvr1|BMP.dgrecvr1|BMP.dgrecvr1|@view.floatingmenu "DiagGuiReg[4]", "RIDReceiver"|示差屈折率検出器 - 光強度
set1= BMP.dgrecvr2|BMP.dgrecvr2|BMP.dgrecvr2|@view.floatingmenu "DiagGuiReg[4]", "RIDReceiver"|示差屈折率検出器 - 光強度
Cursor= CUR...\..\LC\800\HAND1
Help=

[PUSHBUTTON plot]
x=400
y=4
width=40
height=35
State=0
Enable=1
FrameThickness=1
SetIndex=0
;ImageList= RBMP.balance|RBMP.balance|RBMP.balance_gray
ImageList=BMP.dgriplot|BMP.dgriplot|BMP.dgriplot
Command=dgStartRealTimePlot "RID"
Help=オン-ライン シグナル プロット ウィンドウ オープン。
